export const getVersion = () => {
  return {
    version: '1.0.0',
    latestVersion: '1.0.1',
  };
};

export const getAccountInfo = () => {
  return {
    nickname: '몽글어멈',
    email: 'asdf***as@puppyplace.com',
  };
};

export const getServiceTerm = () => {
  return {
    text: `것이다, 커다란 인간의 발휘하기 것은 피어나는 이것이야말로 때문이다. 따뜻한 구하기 뼈 천자만홍이 힘있다. 피어나는 우리의 곳이 수 교향악이다. 쓸쓸하랴? 못할 노래하며 일월과 갑 아름다우냐? 구하지 보내는 원대하고. 풀이 넣는 귀는 보라, 철환하였는가 풀이 끝까지 같이 피다, 어디 인생에 사람은 능히 위하여.
아름다우냐? 이는 인류의 열락의 내려온 약동하다. 황금시대의 따뜻한 인생을 얼마나 발휘하기 부패뿐이다. 위하여서. 청춘은 현저하게 품고 동력은 있는 인간의 능히 천하를 보라, 투명하되 과실이 대중을 그들에게 뿐이다, 부패를 인생에 이상은 보배를 그리하였는가? 품었기 창공에 작고 커다란 용기가 것이 것이다, 불러 우리 위하여. 방지하는 힘있다.

반짝이는 무엇을 듣기만 열매를 소금이라 바이며, 커다란 착목한는 얼마나 사는가 있는가? 이상을 끓는 그들의 보이는 것은 것은 얼음이 것이다. 너의 일월과 미인을 대한 남는 사막이다. 부패뿐이다, 보이는 아니다, 찬미를 옷을 얼마나 풍부하게 청춘이 역사를 약동하다, 품었기 보라. 오직 남는 불어 곳으로 싶이 피가 내는 인류의 보라.

천하를 찾아다녀도, 대중을 투명하되 있는 쓸쓸하랴? 인간의 청춘이 이상은 뜨고. 능히 황금시대의 같이 풀이 봄날의 피가 있는 그들의 것이다. 인간은 그들은 뜨고. 피고 노래하며 천자만홍이 구할 그것은 황금시대다. 불러 과실이 가는 쓸쓸하랴? 보내는 것이 뜨거운지라. 보는 뜨고. 것이다.

것은 군영과 붙잡아 황금시대다. 이상은 있는 소리다. 미인을 구하지 것은 못할 스며들어 위하여서. 인도하겠다는 인간에 하였으며. 만천하의 사랑의 눈에 있다. 충분히 굳세게 인간은 이것이다. 그들의 가는 사는가 이상이 인생을 풀밭에 황금시대를 때문이다. 기쁘며.

인간은 것이다. 고동을 끓는 거친 스며들어 그들을 보라. 방황하였으며. 무한한 크고 인간의 사람은 넣는 그림자는 이 뿐이다, 아름답고 돋고. 못하다 때에. 용감하고 얼마나 그들을 사라지지 있으며. 목숨이 우는 몸이 원대하고.

인생에 찾아 뼈 같은 위하여 무한한 끓는다. 뼈 그들에게 산야에 아름다우냐? 얼마나 든 찾아 발휘하기 뼈 것이다. 이상의 따뜻한 길을 열락의 굳세게 것이다. 귀는 자신과 위하여서 속잎나고. 아름다우냐? 불러 구하지 그들은 아름다우냐? 속잎나고. 바이며. 있다, 이것은 듣는다.

듣기만 부패뿐이다. 사막이다, 전인 수 무엇이 보라. 이성은 얼마나 우리 들어 이것이야말로 힘차게 아니한 있는가? 얼마나 싸인 얼음에 부패뿐이다. 불어 불러 되려니와. 뼈 그들은 있는 안고. 위하여, 청춘에서만 있는 속에 사막이다.

천하를 뭇 길을 하는 피가 끝에 때문이다. 옷을 가는 있는 것이다. 그들은 곳으로 구하기 그것은 있다. 목숨이 산야에 우리의 있는 현저하게 것이 쓸쓸하랴? 없는 끓는 바이며. 능히 노래하며 피는 희망의 듣기만 고행을 군영과 때문이다. 평화스러운 사막이다. 전인 노년에게서 풀이 원대하고, 쓸쓸하랴?이것을 심장의 긴지라 착목한는 것이다.

만천하의 밥을 싹이 길을 크고 가치를 보라. 공자는 동력은 위하여 위하여서. 보라. 찬미를 사람은 그들에게 너의 청춘이 인류의 그들의 칼이다, 기쁘며. 살았으며, 간에 품으며. 보라. 
    `,
  };
};

export const changeNickname = async (nickname: string) => {
  console.log(nickname);
  return {
    isSuccess: true,
    message: '닉네임이 변경되었습니다.',
  };
};
